lochoang75/STM32_FREERTOS_BASE/main.c
void vApplicationStackOverflowHook( xTaskHandle *pxTask, signed char *pcTaskName )
{
	/* This function will only be called if a task overflows its stack.  Note
	that stack overflow checking does slow down the context switch
	implementation. */
	for( ;; );
}
/*-----------------------------------------------------------*/

void vApplicationIdleHook( void )
{
	/* This example does not use the idle hook to perform any processing. */
	//HAL_IncTick();
	//HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_12);
}
/*-----------------------------------------------------------*/

void vApplicationTickHook( void )
{
	/* This example does not use the tick hook to perform any processing. */
}

void turnOnRedLED(void){
	//Turn on pin 14
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14,GPIO_PIN_SET);
	//12,13,15
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15,GPIO_PIN_RESET);
}

void turnOnBlueLED(void){
	//Turn on pin 15
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15,GPIO_PIN_SET);
	//12,13,14 off
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14,GPIO_PIN_RESET);
}

void turnOnOrangeLED(void){
	//Turn on pin 13
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13,GPIO_PIN_SET);
	//12,14,15 off
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15,GPIO_PIN_RESET);
}

void turnOnGreenLED(void){
	//Turn on pin 12
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12,GPIO_PIN_SET);
	//13,14,15 off
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15,GPIO_PIN_RESET);
}

void turnOnAllLEDS(void){
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12,GPIO_PIN_SET);
	//13,14,15 off
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13,GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14,GPIO_PIN_SET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15,GPIO_PIN_SET);
}

void turnOffAllLEDS(void){
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15,GPIO_PIN_RESET);
}

void turnOnCurLEDS(led curLed){
	switch(curLed){
		case orange:
			turnOnOrangeLED();
			break;
		case red:
			turnOnRedLED();
			break;
		case blue:
			turnOnBlueLED();
			break;
		case green:
			turnOnGreenLED();
			break;
		default:
			break;
	}
}

void blinkLEDS(led curLed){
	for(int i=0;i<2;i++){
		switch(curLed){
			case red:
				turnOnRedLED();
				break;
			case green:
				turnOnGreenLED();
				break;
			case blue:
				turnOnBlueLED();
				break;
			case orange:
				turnOnOrangeLED();
				break;
			default:
				break;
		}
		vTaskDelay(200);
		turnOffAllLEDS();
		vTaskDelay(200);
	} 
}

int selectedTonesConfirm = 0;
void vTaskConfirm(void){
	for(;;){
		vTaskSuspend(NULL); //waiting the button press to re-trigger the remaining code
		//confirm when DOUBLE_PRESS
		if(button == DOUBLE_PRESS){
			selectedTonesConfirm++;
			for(int i=0;i<2;i++){
				turnOffAllLEDS();
				HAL_Delay(200);
				turnOnAllLEDS();
				HAL_Delay(200);
			}
			turnOffAllLEDS();
		}
	}
}

/*toneLength length = HALF_SEC;
void vTaskIterateLength(void){
	for(;;){
		vTaskSuspend(NULL); //waiting the button press to re-trigger the remaining code
		//confirm when SINGLE
		if(button == SINGLE_PRESS){
			//4 types of length in total. 0.5s, 1.0s, 1.5s, 2.0s
			turnOffAllLEDS();
			switch(length){
				case HALF_SEC:
					//play tone in a predefined length, missing this fucntion
					turnOnOrangeLED();
					break;
				case ONE_SEC:
					turnOnRedLED();
					break;
				case ONE_HALF_SEC:
					turnOnBlueLED();
					break;
				case TWO_SEC:
					turnOnGreenLED();
					break;
			}
		}
	}
}*/

